code/app/controllers/cocktails_controller.rb

  def index
    @cocktails = Cocktail.all
---
SELECT "cocktails".* FROM "cocktails" WHERE (name ILIKE '%margerita%')