code/app/controllers/legislators_controller.rb

  def index
    @legislators = Legislator.all
---
SELECT "legislators".* FROM "legislators" WHERE (name ILIKE '%vesper%')